In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

# 0. Carregando os arquivos

In [2]:
## CSV
fatoDet0 = pd.read_csv('Processado/FatoDetalhes_DadosModelagem.csv',sep=';')
## TXT
fatoCab0 = pd.read_csv('Processado/FatoCabecalho_DadosModelagem.txt',sep='\t')
## EXCEL
dim0     = pd.read_excel('Processado/Dimensoes_DadosModelagem.xlsx')

# 1. Vendo Fato Detalhes (produto)

In [3]:
fatoDet0.head()

   CupomID  ProdutoID  Quantidade Valor Desconto   Custo ValorLiquido
0    10308         69           1  2,12        0  1,8317       0,2883
1    10558         73           3  2,97        0  2,4057       0,5643
2    10259         37           1  4,37        0  3,7757       0,5943
3    11077         73           5  6,11   0,0605   5,838       0,2725
4    10752         69           3  6,57        0  5,3217       1,2483

In [4]:
fatoDet0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2172 entries, 0 to 2171
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CupomID       2172 non-null   int64
 1   ProdutoID     2172 non-null   int64
 2   Quantidade    2172 non-null   int64
 3   Valor         2172 non-null   object
 4   Desconto      2172 non-null   object
 5   Custo         2172 non-null   object
 6   ValorLiquido  2172 non-null   object
dtypes: int64(3), object(4)
memory usage: 118.9+ KB

In [5]:
fatoDet0['Valor']

0           2,12
1           2,97
2           4,37
3           6,11
4           6,57
          ...
2167     21077,2
2168    21109,55
2169     23334,6
2170     32075,2
2171    43755,12
Name: Valor, Length: 2172, dtype: object

## 1.1. Criando fatoDet1 para começar a mudança no dataset

Trocando a ',' por '.' nas celulas, para depois poder mudar 'Object' para 'float'

In [6]:
fatoDet1 = fatoDet0.copy()
for n in fatoDet0.columns[3:]:
    for l in range(0,2172):
        #print(n,'\n',l)
        fatoDet1[n][l] = fatoDet0[n][l].replace(',','.')

<ipython-input-6-f713bea4aaff>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fatoDet1[n][l] = fatoDet0[n][l].replace(',','.')

In [7]:
fatoDet1.head()

   CupomID  ProdutoID  Quantidade Valor Desconto   Custo ValorLiquido
0    10308         69           1  2.12        0  1.8317       0.2883
1    10558         73           3  2.97        0  2.4057       0.5643
2    10259         37           1  4.37        0  3.7757       0.5943
3    11077         73           5  6.11   0.0605   5.838       0.2725
4    10752         69           3  6.57        0  5.3217       1.2483

####################################################################

Fazendo a mudança do tipo de dado, passando de 'object' para 'float'

In [8]:
for n in fatoDet1.columns[3:]:
    fatoDet1[n] = fatoDet1[n].astype(float)

In [9]:
fatoDet1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2172 entries, 0 to 2171
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CupomID       2172 non-null   int64
 1   ProdutoID     2172 non-null   int64
 2   Quantidade    2172 non-null   int64
 3   Valor         2172 non-null   float64
 4   Desconto      2172 non-null   float64
 5   Custo         2172 non-null   float64
 6   ValorLiquido  2172 non-null   float64
dtypes: float64(4), int64(3)
memory usage: 118.9 KB

####################################################################

Descrevendo melhor as features numericas, retirando os IDs

In [10]:
fatoDet1.describe().transpose()[2:]

,count,mean,std,min,25%,50%,75%,max
Quantidade,2172.0,23.967311,19.189360,1.0000,10.000000,20.00000,30.00000,150.0000
Valor,2172.0,820.970622,2002.528358,2.1200,154.260000,355.07000,796.40000,43755.1200
Desconto,2172.0,49.608513,226.864961,0.0000,0.000000,0.00000,26.83500,7292.5201
Custo,2172.0,653.911917,1577.331337,1.8317,123.350075,282.27510,648.23760,32160.0132
ValorLiquido,2172.0,167.058479,455.554312,0.2725,25.181250,63.57665,148.11525,11595.1069

# 2. Vendo Fato Cabeçalho (entrega/venda)

In [11]:
fatoCab0.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,22/03/2018,78,11,"12,45",11081,Freight Express,05/04/2018
1,21/11/2016,62,3,"20,01",10637,One Liners,24/11/2016
2,16/09/2017,64,3,"20,36",11019,One Liners,03/10/2017
3,02/07/2017,80,11,"20,53",10982,Freight Express,04/07/2017
4,16/09/2016,28,5,"20,61",10328,Ship for U,29/09/2016

In [12]:
datas = ['Data','DataEntrega']
fatoCab1 = fatoCab0.copy()
for i in datas:
    fatoCab1[i] = pd.to_datetime(fatoCab0[i],format='%d/%m/%Y')

In [13]:
fatoCab1.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,2018-03-22,78,11,"12,45",11081,Freight Express,2018-04-05
1,2016-11-21,62,3,"20,01",10637,One Liners,2016-11-24
2,2017-09-16,64,3,"20,36",11019,One Liners,2017-10-03
3,2017-07-02,80,11,"20,53",10982,Freight Express,2017-07-04
4,2016-09-16,28,5,"20,61",10328,Ship for U,2016-09-29

In [14]:
col_datas= ['Data','DataEntrega']
fatoCab2 = fatoCab1.copy()

for dma in range(2):
    fatoCab2[col_datas[dma]+'_ano'] = fatoCab2[str(col_datas[dma])].apply(lambda x: str(x)[:4])
    fatoCab2[col_datas[dma]+'_mes'] = fatoCab2[str(col_datas[dma])].apply(lambda x: str(x)[5:7])
    fatoCab2[col_datas[dma]+'_dia'] = fatoCab2[str(col_datas[dma])].apply(lambda x: str(x)[8:10])

In [15]:
fatoCab2.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega,Data_ano,Data_mes,Data_dia,DataEntrega_ano,DataEntrega_mes,DataEntrega_dia
0,2018-03-22,78,11,"12,45",11081,Freight Express,2018-04-05,2018,03,22,2018,04,05
1,2016-11-21,62,3,"20,01",10637,One Liners,2016-11-24,2016,11,21,2016,11,24
2,2017-09-16,64,3,"20,36",11019,One Liners,2017-10-03,2017,09,16,2017,10,03
3,2017-07-02,80,11,"20,53",10982,Freight Express,2017-07-04,2017,07,02,2017,07,04
4,2016-09-16,28,5,"20,61",10328,Ship for U,2016-09-29,2016,09,16,2016,09,29

In [16]:
fatoCab2.columns

Index(['Data', 'ClienteID', 'FuncionarioID', 'ValorFrete', 'CupomID',
       'EmpresaFrete', 'DataEntrega', 'Data_ano', 'Data_mes', 'Data_dia',
       'DataEntrega_ano', 'DataEntrega_mes', 'DataEntrega_dia'],
      dtype='object')

In [17]:
fatoCab2 = fatoCab2[['Data', 'Data_ano', 'Data_mes', 'Data_dia', 'ClienteID', 'FuncionarioID', 'ValorFrete', 'CupomID',
       'EmpresaFrete', 'DataEntrega','DataEntrega_ano', 'DataEntrega_mes', 'DataEntrega_dia']]

In [18]:
fatoCab2.head()

,Data,Data_ano,Data_mes,Data_dia,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega,DataEntrega_ano,DataEntrega_mes,DataEntrega_dia
0,2018-03-22,2018,03,22,78,11,"12,45",11081,Freight Express,2018-04-05,2018,04,05
1,2016-11-21,2016,11,21,62,3,"20,01",10637,One Liners,2016-11-24,2016,11,24
2,2017-09-16,2017,09,16,64,3,"20,36",11019,One Liners,2017-10-03,2017,10,03
3,2017-07-02,2017,07,02,80,11,"20,53",10982,Freight Express,2017-07-04,2017,07,04
4,2016-09-16,2016,09,16,28,5,"20,61",10328,Ship for U,2016-09-29,2016,09,29

In [19]:
fatoCab2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data             836 non-null    datetime64[ns]
 1   Data_ano         836 non-null    object
 2   Data_mes         836 non-null    object
 3   Data_dia         836 non-null    object
 4   ClienteID        836 non-null    int64
 5   FuncionarioID    836 non-null    int64
 6   ValorFrete       836 non-null    object
 7   CupomID          836 non-null    int64
 8   EmpresaFrete     836 non-null    object
 9   DataEntrega      836 non-null    datetime64[ns]
 10  DataEntrega_ano  836 non-null    object
 11  DataEntrega_mes  836 non-null    object
 12  DataEntrega_dia  836 non-null    object
dtypes: datetime64[ns](2), int64(3), object(8)
memory usage: 85.0+ KB

####################################################################

Trocando virgulas por ponto nos numericos

In [20]:
for l in range(0,836):
    fatoCab1['ValorFrete'][l] = fatoCab0['ValorFrete'][l].replace(',','.')

<ipython-input-20-40a666c33c46>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fatoCab1['ValorFrete'][l] = fatoCab0['ValorFrete'][l].replace(',','.')

In [21]:
fatoCab1.head()

,Data,ClienteID,FuncionarioID,ValorFrete,CupomID,EmpresaFrete,DataEntrega
0,2018-03-22,78,11,12.45,11081,Freight Express,2018-04-05
1,2016-11-21,62,3,20.01,10637,One Liners,2016-11-24
2,2017-09-16,64,3,20.36,11019,One Liners,2017-10-03
3,2017-07-02,80,11,20.53,10982,Freight Express,2017-07-04
4,2016-09-16,28,5,20.61,10328,Ship for U,2016-09-29

####################################################################

Mudando a feature 'ValorFrete' de 'object' para 'float'

In [22]:
fatoCab1['ValorFrete'] = fatoCab1['ValorFrete'].astype(float)
fatoCab1['EmpresaFrete'] = fatoCab1['EmpresaFrete'].astype('category')

In [23]:
fatoCab1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Data           836 non-null    datetime64[ns]
 1   ClienteID      836 non-null    int64
 2   FuncionarioID  836 non-null    int64
 3   ValorFrete     836 non-null    float64
 4   CupomID        836 non-null    int64
 5   EmpresaFrete   836 non-null    category
 6   DataEntrega    836 non-null    datetime64[ns]
dtypes: category(1), datetime64[ns](2), float64(1), int64(3)
memory usage: 40.2 KB

####################################################################

Verificando melhor as features numericas

In [24]:
fatoCab1.describe().transpose()[2:]

,count,mean,std,min,25%,50%,75%,max
ValorFrete,836.0,50.164043,17.466742,12.45,34.685,49.865,65.7525,79.96
CupomID,836.0,10665.500000,241.476707,10248.00,10456.750,10665.500,10874.2500,11083.00

In [25]:
fatoCab1['FuncionarioID'].value_counts().sort_index()

2      55
3     154
5      53
7     105
9     121
11    134
14     56
56     55
68    103
Name: FuncionarioID, dtype: int64

# 3. Vendo Dimensão (cliente)

In [26]:
dim0.head()

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
0,1,Eintrach GS,Albert von Einstein,Obere Str. 57,Berlin,Germany,DE,Europe,12209.0,52.401482,13.099724,030-0076545,030-0074321
1,2,La Tienda de la Esquina,Paco el Maco,Avda. de la Constitución 2222,Mexico City,Mexico,MX,North America,5021.0,19.631915,-99.133418,(5) 555-3745,(5) 555-4729
2,3,La Ropa Vieja,Sancho Panza,C/ Ritual de lo Habitual 2312,Mexico City,Mexico,MX,North America,5023.0,19.545652,-99.138955,NaN,(5) 555-3932
3,4,Dr Jims Trousers,Carl Montgomery,120 Hanover Sq.,London,UK,GB,Europe,NaN,51.541599,-0.224499,(171) 555-6750,(171) 555-7788
4,5,Urras Shop,Urra Gurra Aktersnurra,Berguvsvägen 8,Gothenburg,Sweden,SE,Europe,NaN,57.811813,12.226721,0921-12 34 67,0921-12 34 65

In [27]:
dim0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     object
 2   NomeContato  90 non-null     object
 3   Endereco     90 non-null     object
 4   Cidade       90 non-null     object
 5   Pais         90 non-null     object
 6   PaisCodigo   90 non-null     object
 7   Regiao       90 non-null     object
 8   CEP          66 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     object
 12  Telefone     88 non-null     object
dtypes: float64(3), int64(1), object(9)
memory usage: 9.3+ KB

####################################################################

Fazendo a mudança do tipo de dado, de 'object' para 'category'

In [28]:
dim1 = dim0.copy()
for i in dim1.columns:
    if(dim1[i].dtype == 'object'):
        dim1[i] = dim1[i].astype('category')

In [29]:
dim1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     category
 2   NomeContato  90 non-null     category
 3   Endereco     90 non-null     category
 4   Cidade       90 non-null     category
 5   Pais         90 non-null     category
 6   PaisCodigo   90 non-null     category
 7   Regiao       90 non-null     category
 8   CEP          66 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     category
 12  Telefone     88 non-null     category
dtypes: category(9), float64(3), int64(1)
memory usage: 24.2 KB

# 4. Avaliando possíveis dados Nan

In [30]:
def avaliando_NaN(df,colunas):
    count = 0
    for col in colunas:
        if (df[str(col)].isnull().sum() >= 1):
            print('Coluna que falta:',str(col))
            print('Qnt linhas:',df[str(col)].isnull().sum())
            print('\n')
            count = count + 1
        
    print('Quantidade de colunas com NaN:',count)

In [31]:
colunasFC1 = fatoCab1.columns
colunasFD1 = fatoDet1.columns
colunasDim = dim1.columns

avaliando_NaN(fatoCab1,colunasFC1)
avaliando_NaN(fatoDet1,colunasFD1)
avaliando_NaN(dim1,colunasDim)

Quantidade de colunas com NaN: 0
Quantidade de colunas com NaN: 0
Coluna que falta: CEP
Qnt linhas: 24


Coluna que falta: Fax
Qnt linhas: 24


Coluna que falta: Telefone
Qnt linhas: 2


Quantidade de colunas com NaN: 3

####################################################################

Verificar quais as linhas que estão com valores nulos e verificar se em alguma estão faltando as 3 informações (iniciar fixando o Telefone, pois é o que tem menos NaNs)



OBS: Acredito que a falta de telefone (e a falta do fax) seja o único 'problema', visto que é o único contato existente, além do endereço físico

In [32]:
dim1[dim1['Telefone'].isnull()]

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
36,37,Boleros,Robert Bolero,8 Johnstown Road,Cork,Ireland,IE,Europe,12580.0,51.912615,-8.322380,NaN,NaN
71,73,Vite,Preben Elkjaer,Vinbæltet 34,Copenhagen,Denmark,DK,Europe,1734.0,55.665325,12.545802,NaN,NaN

In [33]:
dim1[dim1['Fax'].isnull()]

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
2,3,La Ropa Vieja,Sancho Panza,C/ Ritual de lo Habitual 2312,Mexico City,Mexico,MX,North America,5023.0,19.545652,-99.138955,NaN,(5) 555-3932
10,11,Shoe Expert,David Foot,Fauntleroy Circus,London,UK,GB,Europe,NaN,51.507351,-0.127758,NaN,(171) 555-1212
13,14,Das Alpen Shoe,Alfred Neumann,Hauptstr. 29,Bern,Switzerland,CH,Europe,3012.0,46.965197,7.213039,NaN,0452-076545
14,15,Tendha do Flamengo,Edson Arantes do Nascimento,"Av. dos Lusíadas, 23",Sao Paulo,Brazil,BR,South America,NaN,-23.789406,-46.581838,NaN,(11) 555-7647
20,21,Cloe do Pau,Romario do Sauza,"Rua Orós, 92",Sao Paulo,Brazil,BR,South America,NaN,-23.543858,-46.698089,NaN,(11) 555-9857
23,24,Fritid AB,Linda Haglund,Åkergatan 24,Gothenburg,Sweden,SE,Europe,NaN,57.716313,11.925447,NaN,0695-34 67 21
29,30,Los Trajes de Matador,El Cordobes,"Finca La Campana, 33",Seville,Spain,ES,Europe,41101.0,37.423773,-5.876102,NaN,(95) 555 82 82
30,31,Paintho da Gama,Anna Figo,"Av. Brasil, 442",Campinas,Brazil,BR,South America,NaN,-22.890711,-47.063372,NaN,(11) 555-9482
31,32,The Corner Store,Ross The Boss,2732 Baker Blvd.,Eugene,USA,US,North America,97403.0,44.028521,-123.072898,NaN,(503) 555-7555
36,37,Boleros,Robert Bolero,8 Johnstown Road,Cork,Ireland,IE,Europe,12580.0,51.912615,-8.322380,NaN,NaN
37,38,King Size Clothes,Al Yankovic,Crowther Way,Cowes,UK,GB,Europe,NaN,50.692785,-1.300533,NaN,(198) 555-8888
38,39,Noch Einmal GMBH,Dieter Rummernige,Maubelstr. 90,Brandenburg,Germany,DE,Europe,14776.0,52.387714,12.560811,NaN,0555-09876
44,45,Bobby Socks,Vincent Vega,Suite 5,San Francisco,USA,US,North America,94117.0,37.769355,-122.431572,NaN,(415) 555-5938
51,52,Kohl Industries AG,Helmuth Klein,Heerstr. 22,Leipzig,Germany,DE,Europe,4179.0,51.219797,12.140133,NaN,0342-023176
58,60,La Roba do Santho,Leopoldo Samba,Estrada da saúde n. 58,Lisbon,Portugal,PT,Europe,1756.0,38.967866,-9.053562,NaN,(1) 356-5634
60,62,Roba di Piel,Jorge Alemaio,"Alameda dos Canàrios, 891",Sao Paulo,Brazil,BR,South America,NaN,-23.603038,-46.668500,NaN,(11) 555-1189
61,63,Grunewald,George Essen,Taucherstraße 10,Dresden,Germany,DE,Europe,1307.0,51.098392,13.520815,NaN,0372-035188
65,67,Da Bikini Expertu,Thomá Lindao,"Av. Copacabana, 267",Rio de Janeiro,Brazil,BR,South America,NaN,-22.782419,-43.625647,NaN,(21) 555-3412
66,68,Golden Design Group,Carl Perry,Grenzacherweg 237,Geneva,Switzerland,CH,Europe,1203.0,46.205993,6.121909,NaN,0897-034214
69,71,Sunny Ski Store,Perry Farell,187 Suffolk Ln.,Boise,USA,US,North America,83720.0,43.577105,-116.338211,NaN,(208) 555-8097
71,73,Vite,Preben Elkjaer,Vinbæltet 34,Copenhagen,Denmark,DK,Europe,1734.0,55.665325,12.545802,NaN,NaN
75,77,Eye Fashion,Charles Oakley,Suite 2,Miami,USA,US,North America,33101.0,25.851680,-80.211607,NaN,(305) 555-3612
78,80,Don Balón,Peloto Gomez,Avda. Azteca 123,Mexico City,Mexico,MX,North America,5033.0,19.327933,-99.155692,NaN,(5) 555-2933
85,88,Da Santho Cosmethia,Mariah Erdi,"Rua do Mercado, 12",Resende,Brazil,BR,South America,NaN,-22.480430,-44.494870,NaN,(14) 555-8122

In [34]:
dim1[dim1['CEP'].isnull()]

,ClienteID,Cliente,NomeContato,Endereco,Cidade,Pais,PaisCodigo,Regiao,CEP,Latitude,Longitude,Fax,Telefone
3,4,Dr Jims Trousers,Carl Montgomery,120 Hanover Sq.,London,UK,GB,Europe,NaN,51.541599,-0.224499,(171) 555-6750,(171) 555-7788
4,5,Urras Shop,Urra Gurra Aktersnurra,Berguvsvägen 8,Gothenburg,Sweden,SE,Europe,NaN,57.811813,12.226721,0921-12 34 67,0921-12 34 65
9,10,Big Foot Shoes,James Hendersson,23 Tsawassen Blvd.,Vancouver,Canada,CA,North America,NaN,49.030118,-123.097736,(604) 555-3745,(604) 555-4729
10,11,Shoe Expert,David Foot,Fauntleroy Circus,London,UK,GB,Europe,NaN,51.507351,-0.127758,NaN,(171) 555-1212
14,15,Tendha do Flamengo,Edson Arantes do Nascimento,"Av. dos Lusíadas, 23",Sao Paulo,Brazil,BR,South America,NaN,-23.789406,-46.581838,NaN,(11) 555-7647
15,16,The sharped dressed man,Ian Wright,12 Brewery,London,UK,GB,Europe,NaN,51.485789,0.081856,(171) 555-9199,(171) 555-2282
18,19,Th Fashing,Greg Thatcher,35 King George,London,UK,GB,Europe,NaN,51.476020,-0.009019,(171) 555-3373,(171) 555-0297
20,21,Cloe do Pau,Romario do Sauza,"Rua Orós, 92",Sao Paulo,Brazil,BR,South America,NaN,-23.543858,-46.698089,NaN,(11) 555-9857
23,24,Fritid AB,Linda Haglund,Åkergatan 24,Gothenburg,Sweden,SE,Europe,NaN,57.716313,11.925447,NaN,0695-34 67 21
30,31,Paintho da Gama,Anna Figo,"Av. Brasil, 442",Campinas,Brazil,BR,South America,NaN,-22.890711,-47.063372,NaN,(11) 555-9482
33,34,El Carnevale,Joe do Pintho,"Rua do Paço, 67",Rio de Janeiro,Brazil,BR,South America,NaN,-22.930630,-43.358808,(21) 555-8765,(21) 555-0091
37,38,King Size Clothes,Al Yankovic,Crowther Way,Cowes,UK,GB,Europe,NaN,50.692785,-1.300533,NaN,(198) 555-8888
41,42,Millenium,Joe Barry,1900 Oak St.,Vancouver,Canada,CA,North America,NaN,49.265988,-123.126486,(604) 555-7293,(604) 555-3392
49,50,De la Vita,Marco Van Deum,Rue Joseph-Bens 532,Brussels,Belgium,BE,Europe,NaN,50.806429,4.329239,(02) 201 24 68,(02) 201 24 67
50,51,Davenport Fashion,James Belucci,43 rue St. Laurent,Montréal,Canada,CA,North America,NaN,45.585378,-73.553254,(514) 555-8055,(514) 555-8054
52,53,Fawtly Towers,John Cleez,300 Queensbridge,London,UK,GB,Europe,NaN,51.542355,-0.069951,(171) 555-2530,(171) 555-7733
59,61,Copacabana,Giovanni Santhos,"Rua da Panificadora, 12",Rio de Janeiro,Brazil,BR,South America,NaN,-22.908310,-43.197077,(21) 555-4545,(21) 555-4252
60,62,Roba di Piel,Jorge Alemaio,"Alameda dos Canàrios, 891",Sao Paulo,Brazil,BR,South America,NaN,-23.603038,-46.668500,NaN,(11) 555-1189
65,67,Da Bikini Expertu,Thomá Lindao,"Av. Copacabana, 267",Rio de Janeiro,Brazil,BR,South America,NaN,-22.782419,-43.625647,NaN,(21) 555-3412
70,72,Fast Sunglasses,Ray Banned,90 Wadhurst Rd.,London,UK,GB,Europe,NaN,51.406707,-0.065344,(171) 555-5646,(171) 555-1717
74,76,Belgium Black Jeans,Cheril Cow,"Boulevard Tirou, 255",Charleroi,Belgium,BE,Europe,NaN,50.491111,4.456791,(071) 23 67 22 21,(071) 23 67 22 20
79,81,Merced do Vaile,Mercedes Couto,"Av. Inês de Castro, 414",Sao Paulo,Brazil,BR,South America,NaN,-23.362811,-46.661605,(11) 555-2168,(11) 555-2167
85,88,Da Santho Cosmethia,Mariah Erdi,"Rua do Mercado, 12",Resende,Brazil,BR,South America,NaN,-22.480430,-44.494870,NaN,(14) 555-8122
88,91,Slotzy Danz,Boniekk Wallessa,ul. Filtrowa 68,Warsaw,Poland,PL,Europe,NaN,52.519563,20.385878,(26) 642-7012,(26) 642-7012

####################################################################

A falta de CEP pode não acarretar em problemas, visto que em todos que há falta, estão presentes as latitudes e longetudes. Dessa forma, serão apenas mudadas para valores numéricos 0.0, já que não há necessidade da retirada da coluna e não há como fazer imputação (na verdade deve ter como, atraves das coordenadas).

In [35]:
dim2 = dim1.copy()

for cep in range(1,89):
    if pd.isnull(dim2['CEP'][cep]):
        dim2['CEP'][cep] = 0

<ipython-input-35-c226df19ccf2>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dim2['CEP'][cep] = 0

In [36]:
dim2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ClienteID    90 non-null     int64
 1   Cliente      90 non-null     category
 2   NomeContato  90 non-null     category
 3   Endereco     90 non-null     category
 4   Cidade       90 non-null     category
 5   Pais         90 non-null     category
 6   PaisCodigo   90 non-null     category
 7   Regiao       90 non-null     category
 8   CEP          90 non-null     float64
 9   Latitude     90 non-null     float64
 10  Longitude    90 non-null     float64
 11  Fax          66 non-null     category
 12  Telefone     88 non-null     category
dtypes: category(9), float64(3), int64(1)
memory usage: 24.2 KB

# 5. Salvando Dados

In [37]:
excel1 = pd.ExcelWriter('FatoCabecalho_DadosModelagemTratado.xlsx')
fatoCab1.to_excel(excel1)
excel1.save()

In [38]:
excel2 = pd.ExcelWriter('FatoDetalhes_DadosModelagemTratado.xlsx')
fatoDet1.to_excel(excel2)
excel2.save()

In [39]:
excel3 = pd.ExcelWriter('Upload/Dimensoes_DadosModelagemTratado.xlsx')
dim2.to_excel(excel3)
excel3.save()